<template>
    <footer class="footer">
        <div class="container">
            <div class="footer-wrap">
                <div class="footer-menu">
                    <ul class="footer-nav">
                        <li>О Медэк Старз</li>
                        <li><a :href="`${$config.siteURL}/page/about`">О нас</a></li>
                        <li><a :href="`${$config.siteURL}/vacancies`">Вакансии</a></li>
                        <li><a :href="`${$config.siteURL}/news`">Новости</a></li>
                        <li><a :href="`${$config.siteURL}/page/press`">Пресса и СМИ</a></li>
                        <li><a :href="`${$config.siteURL}/clients/reviews`">Отзывы клиентов</a></li>
                        <li><a :href="`${$config.siteURL}/clients`">География поставок</a></li>
                        <li><a :href="`${$config.siteURL}/page/invest`">Инвесторам</a></li>
                        <li><a :href="`${$config.siteURL}/page/dealers`">Дилерам</a></li>
                    </ul>
                    <ul class="footer-nav">
                        <li>Полезное</li>
                        <li><a :href="`${$config.siteURL}`">Главная</a></li>
                        <li><a :href="`${$config.siteURL}/store`">Каталог</a></li>
                        <li><a :href="`${$config.siteURL}/hot`">Акции</a></li>
                        <li><a :href="`${$config.siteURL}/brands`">Все бренды</a></li>
                        <li>
                            <a :href="`${$config.siteURL}/page/partner`">Партнерская программа</a>
                        </li>
                        <li>
                            <a :href="`${$config.siteURL}/page/service`">Ремонт оборудования</a>
                        </li>
                        <li><a :href="`${$config.siteURL}/page/delivery`">Доставка</a></li>
                        <li><a :href="`${$config.siteURL}/page/lizing`">Лизинг и рассрочка</a></li>
                        <li><a :href="`${$config.siteURL}/page/contacts`">Контакты</a></li>
                        <li><a :href="`${$config.siteURL}/delivery/moskva`">Пункты выдачи</a></li>
                    </ul>
                </div>
                <div class="footer-text">
                    <div>
                        <div class="footer-cookie">
                            <p>
                                ООО "Медэк Старз Интернешнл"
                                <a :href="`${$config.siteURL}/page/cookies`" target="_blank">
                                    использует файлы «cookie»,
                                </a>
                                с целью персонализации сервисов и повышения удобства использования.
                                Продолжая использовать сайт, вы соглашаетесь с
                                <a :href="`${$config.siteURL}/page/agreement`">
                                    Пользовательским соглашением.
                                </a>
                                Оставляя заявку, Вы даете согласие на обработку Ваших персональных
                                данных сотрудниками и автоматизированными системами ООО "Медэк Старз
                                Интернешнл".
                            </p>
                        </div>
                    </div>
                    <div>
                        <ul class="footer-info__important">
                            <li>
                                <a :href="`${$config.siteURL}/page/cookies`">
                                    Использование cookies
                                </a>
                            </li>
                            <li>
                                <a :href="`${$config.siteURL}/page/privacy`">
                                    Политика конфиденциальности
                                </a>
                            </li>
                            <li>
                                <a :href="`${$config.siteURL}/page/uridiceskaa-informacia`">
                                    Юридическая информация
                                </a>
                            </li>
                        </ul>
                    </div>
                </div>
            </div>
        </div>
        <div class="container">
            <div class="footer-bottom">
                <div>
                    <p>
                        Наименование: Общество с Ограниченной Отвественностью "Медэк Старз
                        Интернешнл"
                    </p>
                    <p>
                        Юридический адрес: 129626, город Москва, проспект Мира, дом 102, корпус 1,
                        этаж 6, к. 6
                    </p>
                </div>
                <ul class="social">
                    <li>
                        <a href="https://www.facebook.com/medeqstars">
                            <svg
                                xmlns="http://www.w3.org/2000/svg"
                                fill="#d3dbee"
                                width="28"
                                height="28"
                            >
                                <path
                                    d="M28 0H0v28h14V17.42h-3.42v-4.67H14v-1.81c0-3.14 2.35-5.96 5.25-5.96h3.77v4.66h-3.77a1.139 1.139 0 0 0-.89 1.25v1.86h4.66v4.67h-4.66V28H28V0z"
                                />
                            </svg>
                        </a>
                    </li>
                    <li>
                        <a href="https://www.youtube.com/channel/UClJDhAglS06HYJF-SETNB-Q">
                            <svg
                                xmlns="http://www.w3.org/2000/svg"
                                fill="#d3dbee"
                                width="28"
                                height="28"
                            >
                                <path
                                    d="M0 0v28h28V0H0zm16.13 4.72h1.36v4.3a2.371 2.371 0 0 0 .06.91.451.451 0 0 0 .45.36.459.459 0 0 0 .46-.38 3.6 3.6 0 0 0 .04-.94V4.72h1.37v6.46h-1.39l.02-.33-.42-.17a1.349 1.349 0 0 1-.38.48.947.947 0 0 1-.53.16 1.007 1.007 0 0 1-.57-.15.887.887 0 0 1-.31-.38 1.958 1.958 0 0 1-.13-.53c-.02-.21-.03-.64-.03-1.28V4.72zM11.39 7.4a5.706 5.706 0 0 1 .17-1.56 1.561 1.561 0 0 1 .55-.82 1.733 1.733 0 0 1 1.08-.32 2.159 2.159 0 0 1 .96.21 1.532 1.532 0 0 1 .59.53 2.309 2.309 0 0 1 .29.67 6.032 6.032 0 0 1 .07 1.12v1.14a10.165 10.165 0 0 1-.07 1.46 2.207 2.207 0 0 1-.3.77 1.313 1.313 0 0 1-.59.53 1.989 1.989 0 0 1-.87.18 2.472 2.472 0 0 1-.96-.16 1.092 1.092 0 0 1-.54-.42 2.162 2.162 0 0 1-.29-.71 7.813 7.813 0 0 1-.09-1.39V7.4zM8.2 2.42l1.11 3.57c.19-.94.57-2.23.86-3.57h1.01l-1.3 5.09-.01.04v3.62H8.69V7.51l-1.5-5.09H8.2zm16.06 19.97a3.512 3.512 0 0 1-3.2 3.03q-7.065.315-14.12 0a3.512 3.512 0 0 1-3.2-3.03 56.394 56.394 0 0 1 0-7.58 3.521 3.521 0 0 1 3.2-3.03q7.065-.3 14.12 0a3.521 3.521 0 0 1 3.2 3.03 56.394 56.394 0 0 1 0 7.58zM13.25 10.54a.444.444 0 0 0 .42-.32 2.645 2.645 0 0 0 .07-.77v-2.8a2.693 2.693 0 0 0-.07-.85.432.432 0 0 0-.84 0 2.437 2.437 0 0 0-.08.85v2.73a2.429 2.429 0 0 0 .08.82.443.443 0 0 0 .42.34zM5.58 15.3h1.33v7.5h1.4v-7.5h1.33v-1.42H5.58v1.42zm6.6 4.94a6.584 6.584 0 0 1-.04 1.09.467.467 0 0 1-.89.01 5.31 5.31 0 0 1-.05-1.05v-4.26H9.88v4.64c0 .61.01 1.02.03 1.22a1.952 1.952 0 0 0 .14.54.826.826 0 0 0 .84.5.808.808 0 0 0 .49-.14 1.142 1.142 0 0 0 .38-.47l.42.11-.02.37h1.34v-6.77h-1.32v4.21zm5.85-3.87a.822.822 0 0 0-.31-.33 1.092 1.092 0 0 0-.53-.12.878.878 0 0 0-.47.13 1.349 1.349 0 0 0-.41.44l-.41.62v-3.23h-1.32v8.92h1.25l.07-.4.11-.55.3.47a1.556 1.556 0 0 0 .42.48.882.882 0 0 0 .46.14.847.847 0 0 0 .6-.24 1.191 1.191 0 0 0 .33-.6c.05-.26.08-.67.08-.64v-3.54a4.936 4.936 0 0 0-.03-1.09 1.213 1.213 0 0 0-.14-.46zm-1.15 3.93a3.656 3.656 0 0 1-.06.93.437.437 0 0 1-.85.01 2.946 2.946 0 0 1-.07-.86v-1.8a3.176 3.176 0 0 1 .06-.87.427.427 0 0 1 .42-.32.455.455 0 0 1 .44.35 3.722 3.722 0 0 1 .06.85v1.71zm3.61-.69h2.29v-.73a6.6 6.6 0 0 0-.19-1.79 1.528 1.528 0 0 0-.6-.81 2 2 0 0 0-2.04-.06 1.383 1.383 0 0 0-.59.73 4.93 4.93 0 0 0-.19 1.64v2.08a4.807 4.807 0 0 0 .09.93 1.915 1.915 0 0 0 .29.69 1.6 1.6 0 0 0 .58.47 2.112 2.112 0 0 0 .89.18 1.757 1.757 0 0 0 .85-.18 1.465 1.465 0 0 0 .55-.53 2.133 2.133 0 0 0 .29-.68 6.032 6.032 0 0 0 .06-.98v-.32h-1.23v.73a2.4 2.4 0 0 1-.08.79.474.474 0 0 1-.47.33.437.437 0 0 1-.43-.28 2.016 2.016 0 0 1-.07-.7v-1.51zm0-.95v-.76a.82.82 0 0 1 .06-.56.425.425 0 0 1 .44-.28.415.415 0 0 1 .41.31.946.946 0 0 1 .05.53v.98h-.95z"
                                />
                            </svg>
                        </a>
                    </li>
                    <li>
                        <a href="https://vk.com/medeqstars">
                            <svg
                                xmlns="http://www.w3.org/2000/svg"
                                fill="#d3dbee"
                                width="28"
                                height="28"
                            >
                                <path
                                    d="M0 0v28h28V0H0zm23.22 17.06c.51.52 1.62 1.39 1.42 2.28-.19.82-1.41.52-2.59.57-1.36.05-2.16.08-2.97-.57a8.846 8.846 0 0 1-.98-1.09 2.106 2.106 0 0 0-1.32-1.01c-1.03.05-.71 1.49-1.08 2.47-5.71.89-8-2.64-10.03-6.06a52.213 52.213 0 0 1-2.4-5.23l4.04-.01s1.3 2.36 1.64 2.97c.3.51.62.92.95 1.39.28.38.72 1.13 1.2 1.07.78-.1.93-3.14.44-4.16a1.629 1.629 0 0 0-1.14-.7c.16-1.02 4.54-1.23 5.24-.44 1.03 1.15-.71 4.36.7 5.3C18.31 12.8 20 8.47 20 8.47l4.73.03a15.075 15.075 0 0 1-1.52 3.38c-.45.61-1.95 1.96-1.89 2.97.05.79 1.27 1.57 1.9 2.21z"
                                />
                            </svg>
                        </a>
                    </li>
                    <li>
                        <a href="https://www.instagram.com/medeqstars/" target="_blank">
                            <span class="inst" />
                        </a>
                    </li>
                </ul>
            </div>
        </div>
    </footer>
</template>

<script>
export default {};
</script>

<style lang="scss" scoped>
@import '@/assets/sass/layouts/_footer';
</style>
